## **Assignment - 2**

1. Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

```
SELECT LEFT(First_Name, 3) AS 'FIRST 3 CHARS'
FROM Worker

```

2. Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.



```
SELECT CHARINDEX('a', First_Name COLLATE Latin1_General_CS_AS) as 'Index'
FROM Worker
WHERE First_Name = 'Amitabh'

```

3. Write an SQL query to print the name of employees having the highest salary in each department.



```

SELECT 
First_Name as 'First Name',
t1.Department as 'Department',
t1.Salary as 'Salary'
FROM Worker
INNER JOIN
(SELECT
MAX(Salary) as 'Salary', 
DEPARTMENT as 'Department'
FROM Worker
GROUP BY Department) AS t1
ON Worker.Department = t1.Department 
AND Worker.Salary = t1.Salary


```